# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define g = Character('Yasunori', color="#f542e3")
define m = Character('Me', color="#f58442")



# The game starts here.

label start:

    # Show a background. This uses a placeholder by default, but you can
    # add a file (named either "bg room.png" or "bg room.jpg") to the
    # images directory to show it.

    scene sunset
    with fade

    # This shows a character sprite. A placeholder is used, but you can
    # replace it by adding a file named "eileen happy.png" to the images
    # directory.

    

    # These display lines of dialogue.
    #
    #
    

    play music "tilt.ogg"
   
    m "Моя первая любовь пришла ко мне во время старшей школы, перевод в новую школу, новые знакомства"
    m "Впервые мы встретились на перекличке, мне хватило одного взгляда чтобы молниеносным потоком в голове пронеслась фраза «Она станет моей», что очень удивило такое дерзкое заявление, которое никак нельзя приписать ко мне."
    m "Но тяга к ней была столь сильна, будто во мне отозвалось доселе не испытанное чувство."
    m "Шли дни, наше общение становилось все более теплым и непринужденным, меня захлестнул поток чувств к ней, не проходило и дня как я не искал в интернете как произвести впечатление, на какие вопросы с ней поговорить"
    m "Я дорожил каждым воспоминанием с ней, особенно грело душу, когда она посвящала меня в свою жизнь. Вот так иметь возможность перекидываться фразами на бытовые темы было для меня всем. "
    m "Первая прогулка за руки, парки аттракционов, фильмы в кинотеатре, не было никого счастливее меня в те дни. Наши отношения можно было назвать идеальными, девушка в которой я видел только хорошее изо дня в день все больше нравилась мне."
    m "Но мой идеальный мир рассыпался и из-за чего? "
    m "Все начало трескаться постепенно, почти не читала сообщения, стала более отстраненной, но сколько я не пытался поговорить об этом она съезжала с темы разговора, говоря, что я придумываю себе"
    m "Вскоре со стороны знакомых доносились слухи, что она гуляет с каким-то парнем, банальное вранье в которое я отказывался верить и до последнего надеялся, что все наладиться, но наши отношения закончились сухим предложением «давай разойдемся»."
    m "Первая в жизни девушка, в которую я влюбился до беспамятства, девушка о которой я мог часами говорить, что мне в ней нравится поигралась со мной, а после выбросила как ненужную игрушку."
